#+TITLE: Project Notes


* Tasks
** DONE Implement structure for partial proofs
** DONE Implement Reiter tactic
:PROPERTIES:
:ESTIMATE: 2:00
:actual:   5:10
:END:
:LOGBOOK:
CLOCK: [2020-01-05 Sun 20:47]--[2020-01-05 Sun 20:58] =>  0:11
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2020-01-05 Sun 20:58]
| Headline                    | Time   |      |
|-----------------------------+--------+------|
| *Total time*                | *5:10* |      |
|-----------------------------+--------+------|
| \_  Implement Reiter tactic |        | 5:10 |
#+END:

CLOCK: [2020-01-05 Sun 20:04]--[2020-01-05 Sun 20:44] =>  0:40
CLOCK: [2020-01-05 Sun 19:19]--[2020-01-05 Sun 19:24] =>  0:05
CLOCK: [2020-01-05 Sun 18:43]--[2020-01-05 Sun 19:12] =>  0:29
CLOCK: [2020-01-05 Sun 16:37]--[2020-01-05 Sun 17:42] =>  1:05
CLOCK: [2020-01-05 Sun 15:24]--[2020-01-05 Sun 15:29] =>  0:05
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2020-01-05 Sun 19:24]
| Headline                    | Time   |      |
|-----------------------------+--------+------|
| *Total time*                | *4:19* |      |
|-----------------------------+--------+------|
| \_  Implement Reiter tactic |        | 4:19 |
#+END:

CLOCK: [2020-01-05 Sun 14:42]--[2020-01-05 Sun 15:00] =>  0:18
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2020-01-05 Sun 15:23]
| Headline                    | Time   |      |
|-----------------------------+--------+------|
| *Total time*                | *2:35* |      |
|-----------------------------+--------+------|
| \_  Implement Reiter tactic |        | 2:35 |
#+END:

CLOCK: [2020-01-05 Sun 14:09]--[2020-01-05 Sun 14:18] =>  0:09
CLOCK: [2020-01-05 Sun 13:40]--[2020-01-05 Sun 13:49] =>  0:09
CLOCK: [2020-01-05 Sun 08:58]--[2020-01-05 Sun 10:00] =>  1:02
CLOCK: [2020-01-04 Sat 22:21]--[2020-01-04 Sat 22:57] =>  0:36
CLOCK: [2020-01-02 Thu 17:51]--[2020-01-02 Thu 17:57] =>  0:06
:END:
- Check if focused figure is an initial formula
- If so, then place initial over a hole, duplicate, and replace initial with
  duplicated initials with holes
*** DONE Walk through code, and identify needed steps
:PROPERTIES:
:ESTIMATE: 20min
:END:
:LOGBOOK:
CLOCK: [2020-01-02 Thu 17:35]--[2020-01-02 Thu 17:50] =>  0:15
:END:
*** Notes
Arrg.. very frustrated. I've implemented the expected logic, but nothing's
happening. I feel like the program has fallen out of my head, and it's
distressing to learn that program is so poorly organized, and/or in general it's
so easy to loose track of how a program works.

Feeling like my abilities are so far from where I wish they were... :(
** DONE Generalize calculus to a calculus of partial proofs
:PROPERTIES:
:ESTIMATE: 1:00
:ACTUAL:   1:36
:END:
:LOGBOOK:
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2020-01-11 Sat 15:42]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *1:36* |
|--------------+--------|
#+END:

CLOCK: [2020-01-11 Sat 14:50]--[2020-01-11 Sat 15:42] =>  0:52
CLOCK: [2020-01-11 Sat 14:22]--[2020-01-11 Sat 14:42] =>  0:20
CLOCK: [2020-01-11 Sat 12:09]--[2020-01-11 Sat 12:28] =>  0:19
CLOCK: [2020-01-10 Fri 22:24]--[2020-01-10 Fri 22:29] =>  0:05
:END:


** TODO Make calculus work on focused proofs?
** TODO List all tactics
** TODO Add tutorial
*** Principles
**** Introduction and Elimination
**** Conjunction
***** Forming Collections
***** Making Selections
**** Implication
***** Drawing Connections
***** Producing Results
**** Disjunction
***** Adding Alternatives
***** Dealing with Outcomes
**** Negation
***** Rejecting Absurdity
** TODO UI
*** TODO Simple, menu-based UI to flesh out basic functionality
- A single menu location
*** TODO Develop a non-mathy, playful and intuitive representation for the notation
*** TODO Embed the proof transformation UI into the structures of the terms
- This means the representation must have natural *handles* for every tactic and
  logical move that can be made.
- This calls for an application of algebraic semiotics:
  - Each term has /functionality/ (elim/intro)
  - The structure of the representation must be a mapping to this functionality
  - Ditto with figure-level manipulations
*** TODO Develop highly intuitive disjunction elim
*** TODO Add interactive illumination of proof parts on hover/click
- When an operator is hovered over, illuminate scope of sub formulae
- Hover on assumption to illuminate all uses
- Indicate when formula is still under license of assumption
*** TODO Implement UI for cuts
** TODO Detect unsolvable proofs and alert user
** TODO Name
- ND Project
- Deduction + Education
  - de∘ed∘euc∘ea∘etion
  - edu∘deduction
  - (Educa|Deduc)iton
